Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: ; Without even having to release right-control, press Enter to reverse direction.
ja: ; 右クリックを離すことなく、Enterキーを押すと方向が反転します。

source: ; Without the declaration, the above assigned to a local "g".
ja: ; 宣言がない場合、上記はローカルな "g "に割り当てられる。

source: ; Wrap ti to ensure automatic cleanup.
ja: ; 自動洗浄を確実にするために、Wrap tiを使用します。

source: ; and the caller will implicitly provide 'this'.
ja: ; であり、呼び出し側は暗黙のうちに 'this' を提供することになる。

source: ; be a problem in raw mode:
ja: ; rawモードでは問題ありません：

source: ; because they provide correct coordinates even if the user pressed the Apps key:
ja: ; Appsキーを押しても正しい座標が表示されるからです：

source: ; being searched.
ja: ; 検索される。

source: ; by calling VariantClear or assigning a pure numeric value:
ja: ; VariantClearを呼び出すか、純粋な数値を代入することで対応します。

source: ; directories such as C:\.
ja: ; C:\などのディレクトリがあります。

source: ; err.Line indicates this line.
ja: ; err.Lineはこの行を示す。

source: ; especially for a folder containing hundreds of files:
ja: ; 特に数百のファイルを含むフォルダの場合：

source: ; for stderr
ja: ; 標準エラー用

source: ; for stdin
ja: ; 標準入力用

source: ; for stdout
ja: ; 標準出力用

source: ; found (in case adjacent rows are selected):
ja: ; 見つかった（隣接する行が選択された場合）：

source: ; hs will hold the name of the hotstring which triggered the function.
ja: ; hsには、この関数のトリガーとなったホットストリングの名前が入ります。

source: ; i.e. Any single statement can be on the same line with an Else.
ja: ; すなわち、任意の1つの文がElseと同じ行に存在することができます。

source: ; i.e. Do nothing.
ja: ; すなわち、何もしない。

source: ; in the array does not require search-loop.
ja: ; 配列の中の ;はサーチループを必要としない。

source: ; key's virtual key, which can be discovered in the first column of the Key History screen.
ja: ; キーヒストリー画面の最初の列で発見できる、 ;キーの仮想キーです。

source: ; launch Window Spy or the Help file.
ja: ; Window Spyやヘルプファイルを起動することができます。

source: ; leave the contents of the URL var untouched.
ja: ; URL varの中身はそのままにしておく。

source: ; left
ja: ; 左

source: ; might damage them:
ja: ; 破損する可能性があります：

source: ; note that it seems that double quotes can legitimately exist inside URLs, so this
ja: ; 二重引用符はURLの中に合法的に存在できるようなので、この

source: ; or
ja: ; または

source: ; pastes time and date
ja: ; 時刻と日付を貼り付けます。

source: ; press of the hotkey).
ja: ; ホットキーの押下）。

source: ; pweb will release its ptr automatically, so AddRef to counter that.
ja: ; pwebは自動的にptrを解放するので、それに対抗するためにAddRefします。

source: ; read the file ("r"), share all access except for delete ("-d")
ja: ; read the file ("r")は、削除（"-d"）を除くすべてのアクセスを共有する。

source: ; responsive while the download is taking place, whereas async=false
ja: ; async=falseの場合、ダウンロードが行われている間、レスポンシブに動作します。

source: ; restored later.
ja: ; 後日、復元されます。

source: ; returns the number of files/folders that could not be copied.
ja: ; コピーできなかったファイル／フォルダの数を返す。

source: ; returns the number of files/folders that could not be moved.
ja: ; 移動できなかったファイル／フォルダの数を返す。

source: ; sc should be initialized as in the example below.
ja: ; scは、以下の例のように初期化する必要があります。

source: ; several calls can be avoided and loading performance is greatly improved,
ja: ; 何度も呼び出す必要がなく、ロードのパフォーマンスが大幅に向上します、

source: ; so that the code below can refer to it naturally rather than as %url%.
ja: ; 以下のコードで%url%としてではなく、自然に参照できるようにするためです。

source: ; statement to execute for each iteration
ja: ; 各繰り返しで実行される ;ステートメント

source: ; statement to execute if condition is false
ja: ; 条件が偽の場合に実行されるステートメント

source: ; subtract 1 so that the search includes the same row number that was previously
ja: ; 検索対象が、以前と同じ行番号になるように、1を引きます。

source: ; such as dashes. This unique ID method also performs better because finding an item
ja: ; ダッシュのようなまた、このユニークID方式は、アイテムを探す際に

source: ; table (vtable for short). The remainder of the expression retrieves
ja: ; テーブル（略してvtable）。この式の残りの部分は

source: ; than nothing:
ja: ; 何もしないよりは：

source: ; the SID and IID are the same, but it isn't always this way.
ja: ; SIDとIIDは同じですが、いつもこうとは限りません。

source: ; the address of the nth function's address from the vtable.
ja: ; vtableからn番目の関数のアドレスを取得します。

source: ; the methods more usable without requiring wrapper functions.
ja: ; ラッパー関数を必要とせず、より使いやすいメソッドを提供します。

source: ; through all open MSIE windows, one at a time (i.e. each
ja: ; 開いているすべてのMSIEウィンドウを一度に1つずつ（つまり、それぞれのウィンドウに

source: ; vkFF is no mapping.
ja: ; vkFFはマッピングなしです。

source: ; when vType != VT_VARIANT so that VariantClear can be used by __delete.
ja: ; VariantClearを__deleteで使用できるように、vType != VT_VARIANTのとき ;。

source: ; will make the script unresponsive.
ja: ; すると、スクリプトが応答しなくなります。

source: ; x causes this to become a closure.
ja: ; x はクロージャになる。

source: ;*Esc::Send "{Esc}{Alt up}" ; Without tilde (~), Escape would need to be sent.
ja: ;*Esc::Send "{Esc}{Alt up}" ; チルダ（~）がなければ、エスケープを送信する必要があります。

source: ;global g ; <-- This is required to assign to the global variable.
ja: ; global g ; <-- グローバル変数に代入するために必要です。

source: #ErrorStdOut's parameter may now optionally be enclosed in quote marks.
ja: #ErrorStdOutのパラメータを引用符で囲むことができるようになりました（オプション）。

source: #HotIf (formerly #If) now implicitly creates a function with one parameter (ThisHotkey).
ja: #HotIf（旧#If）は、1つのパラメータ（ThisHotkey）を持つ関数を暗黙のうちに作成するようになりました。

source: #HotIfTimeout may be used to override the default timeout value.
ja: #HotIfTimeoutを使用すると、デフォルトのタイムアウト値をオーバーライドすることができます。

source: #Hotstring EndChars also affects this setting.
ja: #Hotstring EndCharsも、この設定に影響します。

source: #Hotstring NoMouse also affects this setting, and is equivalent to specifying false for NewValue.
ja: #Hotstring NoMouse も、この設定に影響し、NewValueにfalseを指定することと同じです。

source: #Include is relative to the directory containing the current file by default.
ja: #Includeは、デフォルトでカレントファイルを含むディレクトリからの相対パスとなります。

source: #InputLevel and SendLevel provide additional control over which hotkeys and hotstrings are triggered by the Send function.
ja: #InputLevelと SendLevelは、Send関数によってトリガーされるホットキーとホットストリングをさらにコントロールすることができます。

source: #MaxThreads and #MaxThreadsPerHotkey no longer make exceptions for any subroutine whose first line is one of the following functions:
ja: #MaxThreadsと #MaxThreadsPerHotkeyは、最初の行が以下の関数のいずれかであるサブルーチンの例外を作らないようになりました：

source: #MaxThreads and #MaxThreadsPerHotkey no longer make exceptions for any subroutine whose first line is one of the following functions: ExitApp, Pause, Edit, Reload, KeyHistory, ListLines, ListVars, or ListHotkeys.
ja: #MaxThreadsと#MaxThreadsPerHotkeyは、最初の行が以下の関数のいずれかであるサブルーチンの例外を作らないようになりました：ExitApp、Pause、Edit、Reload、KeyHistory、ListLines、ListVars、ListHotkeys。

source: #MaxThreads, #MaxThreadsBuffer, Critical, Threads, Hotkey, A_MaxHotkeysPerInterval, ListHotkeys
ja: #MaxThreads、#MaxThreadsBuffer、Critical、スレッド、Hotkey、A_MaxHotkeysPerInterval、ListHotkeys

source: #MaxThreads, #MaxThreadsPerHotkey, Critical, Thread (function), Threads, Hotkey, A_MaxHotkeysPerInterval, ListHotkeys
ja: #MaxThreads、#MaxThreadsPerHotkey、Critical、Thread（関数）、スレッド、Hotkey、A_MaxHotkeysPerInterval、ListHotkeys

source: #MaxThreadsPerHotkey, Threads, A_MaxHotkeysPerInterval, ListHotkeys
ja: #MaxThreadsPerHotkey、スレッド、A_MaxHotkeysPerInterval、ListHotkeys

source: #NoTrayIcon and A_AllowMainWindow affect the behavior of compiled scripts.
ja: #NoTrayIconと A_AllowMainWindowは、コンパイルされたスクリプトの動作に影響します。

source: #NoTrayIcon, TrayTip, Menu object
ja: #NoTrayIcon、TrayTip、Menuオブジェクト

source: #SingleInstance is off by default.
ja: #SingleInstanceはデフォルトでオフになっている。

source: #SingleInstance prompt behaviour is default for all scripts; #SingleInstance on its own activates Force mode.
ja: #SingleInstance のプロンプトの動作は、すべてのスクリプトのデフォルトとなります。

source: #UseHook and #MaxThreadsBuffer allow 1, 0, True and False.
ja: #UseHookと #MaxThreadsBufferは 1、0、True、Falseを許可します。

source: #Warn Unreachable no longer considers lines following an Exit call to be unreachable, as Exit is now an ordinary function.
ja: Exit が通常の関数になったため、#Warn UnreachableでExit呼び出しに続く行を到達不能と見なさないようにしました。

source: #Warn VarUnset was added; it defaults to MsgBox.
ja: #Warn VarUnsetを追加しました。デフォルトは MsgBox です。

source: A_AhkPath always returns the path of the current executable/interpreter, even when the script is compiled.
ja: A_AhkPathは、スクリプトがコンパイルされている場合でも、常に現在の実行ファイル/インタプリタのパスを返します。

source: A_AhkVersion is required to be greater than or equal to this version, but less than the next major version.
ja: A_AhkVersionは、このバージョン以上、次のメジャーバージョン未満であることが必要です。

source: A_AllowMainWindow (read/write; replaces "Menu Tray, MainWindow/NoMainWindow")
ja: A_AllowMainWindow（読み書き可能。「Menu Tray、MainWindow/NoMainWindow」を置換）

source: A_AppData, A_Desktop, A_MyDocuments, A_ProgramFiles, A_Programs, A_StartMenu, A_Startup and Common variants, A_Temp and A_WinDir
ja: A_AppData、A_Desktop、A_MyDocuments、A_ProgramFiles、A_Programs、A_StartMenu、A_StartupおよびCommonバリアント、A_Temp、A_WinDir

source: A_DetectHiddenText (also, it now returns 1 or 0 instead of "On" or "Off")
ja: A_DetectHiddenText(また、「On」または「Off」ではなく、1または0を返すようになりました)

source: A_DetectHiddenWindows (also, it now returns 1 or 0 instead of "On" or "Off")
ja: A_DetectHiddenWindows(また、「On」または「Off」ではなく、1または0を返すようになりました)

source: A_DetectHiddenWindows, A_DetectHiddenText, and A_StoreCapsLockMode use boolean (as do the corresponding functions).
ja: A_DetectHiddenWindows、A_DetectHiddenText、A_StoreCapsLockModeは、booleanを使用します（対応する関数も同様です）。

source: A_FileEncoding (also, it now returns "CP0" in place of "", and allows the "CP" prefix to be omitted when assigning)
ja: A_FileEncoding(また、""の代わりに "CP0"を返すようになり、割り当て時に「CP」のプレフィックスを省略することができるようになりました)

source: A_HotkeyInterval (replaces #HotkeyInterval)
ja: A_HotkeyInterval（#HotkeyIntervalを置換）

source: A_HotkeyModifierTimeout (replaces #HotkeyModifierTimeout)
ja: A_HotkeyModifierTimeout（#HotkeyModifierTimeoutを置換）

source: A_IconHidden or the #NoTrayIcon directive can be used to hide (or show) the tray icon.
ja: A_IconHiddenまたは#NoTrayIconディレクティブを使用すると、トレイアイコンを隠す（または表示する）ことができます。

source: A_IconTip (also, it now always reflects the tooltip, even if it is default or empty)
ja: A_IconTip(また、ツールチップがデフォルトまたは空であっても、常に反映されるようになりました)

source: A_IconTip can be assigned new tooltip text for the tray icon.
ja: A_IconTipは、トレイアイコンの新しいツールチップテキストを割り当てることができます。

source: A_Index: For counted loops, modifying this affects how many iterations are performed.
ja: A_Index：カウントループの場合、この値を変更すると、何回繰り返し実行されるかに影響します。

source: A_InitialWorkingDir (see Default Settings further below)
ja: A_InitialWorkingDir（以下の「初期設定」を参照）

source: A_IsCompiled returns 0 instead of "" if the script has not been compiled.
ja: A_IsCompiledは、スクリプトがコンパイルされていない場合、""の代わりに0を返します。

source: A_IsPaused contains the pause state of the underlying thread.
ja: A_IsPausedは、基礎となるスレッドの一時停止状態を含んでいます。

source: A_LastError is set to the result of the operating system's GetLastError() function.
ja: A_LastErrorには、オペレーティングシステムのGetLastError()関数の結果が設定されます。

source: A_LastError: Calls the Win32 SetLastError() function.
ja: A_LastError：Win32 SetLastError()関数を呼び出します。

source: A_LoopRegKey now contains the root key and subkey, and A_LoopRegSubKey was removed.
ja: A_LoopRegKeyにルートキーとサブキーが含まれるようになり、A_LoopRegSubKeyが削除されました。

source: A_MaxHotkeysPerInterval (replaces #MaxHotkeysPerInterval)
ja: A_MaxHotkeysPerInterval（#MaxHotkeysPerIntervalを置き換えます）

source: A_MenuMaskKey (replaces #MenuMaskKey)
ja: A_MenuMaskKey（#MenuMaskKeyを置き換える）

source: A_OSVersion always returns a string in the format major.minor.build, such as 6.1.7601 for Windows 7 SP1.
ja: A_OSVersionは常にmajor.minor.buildという形式の文字列を返し、例えば Windows 7 SP1 では6.1.7601となります。

source: A_PriorHotkey and A_TimeSincePriorHotkey temporarily contain the previous values of the corresponding "This" variables.
ja: A_PriorHotkey、A_TimeSincePriorHotkeyは、対応する「This」変数の以前の値を一時的に保持します。

source: A_ScreenDPI returns the DPI setting of the primary screen.
ja: A_ScreenDPIは、プライマリ画面の DPI 設定を返す。

source: A_ScriptHwnd also returns a pure integer.
ja: A_ScriptHwndも、純粋な整数を返します。

source: A_ScriptName and A_ScriptFullPath both contain "*".
ja: A_ScriptNameとA_ScriptFullPathの両方に「*」が含まれている。

source: A_ScriptName: Changes the default dialog title.
ja: A_ScriptName：デフォルトのダイアログのタイトルを変更します。

source: A_StoreCapsLockMode (also, it now returns 1 or 0 instead of "On" or "Off")
ja: A_StoreCapsLockMode(また、「On」または「Off」の代わりに 1 または 0 を返すようになりました)

source: A_TimeIdleKeyboard and A_TimeIdlePhysical can work correctly (ignoring mouse input or artificial input, respectively).
ja: A_TimeIdleKeyboardと A_TimeIdlePhysicalが正しく動作するようになりました（それぞれマウス入力や人工入力を無視します）。

source: A_TimeIdleMouse and A_TimeIdlePhysical can work correctly (ignoring keyboard input or artificial input, respectively).
ja: A_TimeIdleMouseと A_TimeIdlePhysicalが正しく動作するようになりました（それぞれキーボード入力や人工入力を無視します）。

source: A_TimeSincePriorHotkey returns "" instead of -1 whenever A_PriorHotkey is "", and likewise for A_TimeSinceThisHotkey when A_ThisHotkey is blank.
ja: A_PriorHotkeyが""の場合、A_TimeSincePriorHotkeyは-1ではなく""を返し、A_ThisHotkeyが空白の場合も同様にA_TimeSinceThisHotkeyは-1を返します。

source: A_TrayMenu returns a Menu object which can be used to customise the tray menu.
ja: A_TrayMenuは、トレイメニューをカスタマイズするために使用できるMenu オブジェクトを返します。

source: A_WorkingDir: Same as calling SetWorkingDir.
ja: A_WorkingDir：SetWorkingDirを呼び出すのと同じです。

source: Abs: Returns the absolute value of a number.
ja: Abs：数値の絶対値を返します。

source: ActiveX (e.g. Internet Explorer Control)
ja: ActiveX(Internet Explorer Controlなど)

source: Add: Adds a new item to the TreeView.
ja: Add：TreeViewに新しいアイテムを追加します。

source: Add: Adds a new row to the bottom of the list.
ja: Add：リストの一番下に新しい行を追加します。

source: Add: Adds or modifies a menu item.
ja: Add：メニュー項目を追加または変更します。

source: AddResource: Adds a resource to the .exe.
ja: AddResource：.exe にリソースを追加する。

source: AddStandard: Adds the standard tray menu items.
ja: AddStandard：標準トレイのメニュー項目を追加します。

source: Alt-tab hotkeys are not affected by #HotIf:
ja: Alt-tabのホットキーは、#HotIfの影響を受けません。

source: Alt-tab hotkeys are not affected by #HotIf: they are in effect for all windows.
ja: Alt-tabのホットキーは、#HotIfの影響を受けません：これらはすべてのウィンドウで有効です。

source: Any
ja: 任意

source: Array
ja: 配列

source: Array and Map have a Delete method, which removes the value from the array or map.
ja: Arrayと MapにはDeleteメソッドがあり、配列やマップから値を削除する。

source: Array elements with no value (such as the first element in [,2]) are equivalent to omitting the parameter; that is, the parameter's default value is used if it is optional, otherwise an exception is thrown.
ja: 値がない配列要素（[,2]の最初の要素など）は、パラメータを省略したのと同じです。つまり、パラメータがオプションの場合はそのパラメータのデフォルト値が使用され、それ以外の場合は例外が投げられます。

source: Array has the RemoveAt method, which removes an array element or range of array elements.
ja: 配列には RemoveAtメソッドがあり、配列要素や配列要素の範囲を削除します。

source: Array of Strings
ja: 文字列の配列

source: AutoHotkey Beginner Tutorial by tidbit covers a range of topics.
ja: AutoHotkey初心者チュートリアルは、様々なトピックをカバーしています。

source: AutoHotkey2 Language Support provides many features, including:
ja: AutoHotkey2言語サポートは、以下を含む多くの機能を提供します：

source: BS_AUTOCHECKBOX or BS_AUTO3STATE
ja: BS_AUTOCHECKBOXまたはBS_AUTO3STATE

source: BS_PUSHBUTTON or BS_DEFPUSHBUTTON
ja: BS_PUSHBUTTONまたはBS_DEFPUSHBUTTON

source: BackColor: Retrieves or sets the background color of the window.
ja: BackColor：ウィンドウの背景色を取得または設定します。

source: Base: Retrieves or sets an object's base object.
ja: Base：オブジェクトのベースオブジェクトを取得または設定する。

source: Base: Retrieves the value's base object.
ja: Base：値のベースとなるオブジェクトを取得します。

source: Basic Usage - Arrays, Maps (Associative Arrays), Objects, Freeing Objects
ja: 基本的な使い方：配列、Maps（連想配列）、オブジェクト、オブジェクトの解放

source: Bin / Base: Specifies the base version of AutoHotkey to use.
ja: Bin / Base：使用するAutoHotkeyの基本バージョンを指定します。

source: Binary Compatibility, Buffer object, ComCall, PostMessage, OnMessage, CallbackCreate, Run, VarSetStrCapacity, Functions, SysGet, #DllLoad, Windows API Index
ja: バイナリ互換性、Bufferオブジェクト、ComCall、PostMessage、OnMessage、CallbackCreate、Run、VarSetStrCapacity、関数、SysGet、#DllLoad、Windows API インデックス

source: Bind: Binds parameters to the function.
ja: Bind: 関数にパラメータを結びつけます。

source: Bitwise-not (~)
ja: ビットワイズ・ノット (~)

source: BlockInput is no longer momentarily disabled whenever an Alt event is sent with the SendEvent method.
ja: SendEventメソッドでAltイベントを送信したときに、BlockInputが一瞬だけ無効になることがなくなりました。

source: BlockInput should be avoided when using ControlSend against a console window such as command prompt.
ja: コマンドプロンプトなどのコンソールウィンドウに対してControlSendを使用する場合は、BlockInputを使用しないようにしてください。

source: Blocks, If, Control Flow Statements
ja: ブロック、If、制御フロー文

source: Boolean
ja: 論理値

source: Boolean false, sometimes meaning "off", "no", etc.
ja: ブール値のfalseで「オフ」や「ノー」などの意味を持つこともある。

source: Boolean true, sometimes meaning "on", "yes", etc.
ja: ブール値の真偽。「オン」「イエス」などの意味を持つこともある。

source: Break exits (terminates) a loop, effectively jumping to the next line after the loop's body.
ja: Breakは、ループを抜ける（終了する）ことで、ループのボディの次の行に効果的にジャンプすることができます。

source: Break exits (terminates) a loop.
ja: Breakは、ループを抜ける（終了させる）。

source: Break, Loop, Until, While-loop, For-loop, Blocks, Labels
ja: Break、Loop、Until、Whileループ、Forループ、ブロック、ラベル

source: Buffer object, DllCall, NumPut, NumGet
ja: Bufferオブジェクト、DllCall、NumPut、NumGet

source: ByRef parameters also support default values; for example:
ja: ByRefパラメータは、デフォルト値にも対応しています（例）。

source: ByRef parameters also support default values; for example: MyFunc(&p1 := "").
ja: ByRefパラメータは、デフォルト値にも対応しています（例：MyFunc(&p1 := "")）。

source: ByRef parameters are now declared using &param instead of ByRef param, with some differences in usage.
ja: ByRefパラメータは、ByRef paramの代わりに&paramを使用して宣言されるようになり、使い方に若干の違いがあります。

source: Call: Calls the function.
ja: Call：関数を呼び出します。

source: Call: Constructs a new instance of the class.
ja: Call：このクラスの新しいインスタンスを構築します。

source: Call: Creates a Map and sets items.
ja: Call：Mapを作成し、項目を設定する。

source: Call: Creates a new Array containing the specified values.
ja: Call：指定された値を含む新しい配列を作成します。

source: Call: Creates a new Buffer object.
ja: Call：新しいBufferオブジェクトを作成します。

source: Call: Creates a new Menu or MenuBar object.
ja: Call：新しい Menu または MenuBar オブジェクトを作成します。

source: Call: Creates a new Object.
ja: Call：新しいObjectを作成します。

source: Call: Retrieves the next item or items in an enumeration.
ja: Call：列挙された項目のうち、次の項目を取得します。

source: CallbackCreate, OnExit, OnClipboardChange, PostMessage, SendMessage, Functions, Windows Messages, Threads, Critical, DllCall
ja: CallbackCreate、OnExit、OnClipboardChange、PostMessage、SendMessage、関数、Windowsメッセージ、スレッド、Critical、DllCall

source: Capacity: Retrieves or sets the current capacity of a map.
ja: Capacity：マップの現在の容量を取得または設定します。

source: Capacity: Retrieves or sets the current capacity of an array.
ja: Capacity：配列の現在の容量を取得または設定します。

source: CaseSense: Retrieves or sets a map's case sensitivity setting.
ja: CaseSense：マップの大文字と小文字の区別の設定を取得または設定します。

source: CaseSensitive: Controls whether MatchList is case-sensitive.
ja: CaseSensitive：MatchListが大文字と小文字を区別するかどうかを制御します。

source: Catch executes if an exception of a given type is thrown within a try statement.
ja: Catchは、try文の中で指定された型の例外が発生した場合に実行されます。

source: Ceil: Returns a number rounded up to the nearest integer.
ja: Ceil：最も近い整数に切り上げられた数値を返します。

source: Changes from v1.1 to v2.0 covers the differences between v1.1 and v2.0.
ja: v1.1からv2.0への変更点は、v1.1とv2.0の相違点をカバーしています。

source: Changes from v1.1 to v2.0.
ja: v1.1からv2.0への変更点。

source: Check: Adds a visible checkmark next to a menu item.
ja: Check：メニューの横に、目に見えるチェックマークを付けます。

source: Clear: Removes all key-value pairs from a map.
ja: Clear：マップからすべてのキーとバリューのペアを削除します。

source: ClipStep: Control multiple clipboards using only the keyboard's Ctrl-X-C-V.
ja: ClipStep：キーボードのCtrl-X-C-Vだけで複数のクリップボードを操作できます。

source: ClipWait may be used to detect when the clipboard contains data (optionally including non-text data).
ja: ClipWaitは、クリップボードにデータ（オプションで非テキストデータも含む）が含まれていることを検出するために使用することができる。

source: ClipWait may be used to detect when the clipboard contains data (optionally including non-text data):
ja: ClipWaitは、クリップボードにデータ（オプションで非テキストデータも含む）が含まれていることを検出するために使用することができる：

source: ClipWait now returns 0 (false) if the wait period expires, otherwise 1 (true).
ja: ClipWaitは、待ち時間が終了した場合は0 (false)を、そうでない場合は1 (true)を返すようになりました。

source: ClipWait now returns 0 if the wait period expires, otherwise 1.
ja: ClipWaitは、待ち時間が終了した場合は0を、そうでない場合は1を返すようになりました。

source: ClipboardAll returns a sub-type of Buffer, also named ClipboardAll.
ja: ClipboardAllは、BufferのサブタイプであるClipboardAllを返す。

source: ClipboardAll: For operating upon everything on the clipboard (such as pictures and formatting).
ja: ClipboardAll：クリップボード上のすべてのもの（画像や書式など）を操作するためのものです。

source: Clone is used as before.
ja: Cloneは従来通り使用します。

source: Clone: Returns a shallow copy of a map.
ja: Clone：マップの浅いコピーを返します。

source: Clone: Returns a shallow copy of an array.
ja: Clone：配列のシャローコピーを返します。

source: Clone: Returns a shallow copy of an object.
ja: Clone：オブジェクトのシャローコピーを返す。

source: Close: Closes the file, flushes any data in the cache to disk and releases the share locks.
ja: Close：ファイルを閉じ、キャッシュ内のデータをディスクにフラッシュし、共有ロックを解除します。

source: Code blocks are lines of code surrounded by little curly brackets ({ and }).
ja: コードブロックとは、小さな中括弧（{と }）で囲まれたコード行のことである。

source: ComCall can be used to call native interface methods.
ja: ComCallは、ネイティブインターフェースのメソッドを呼び出すために使用することができます。

source: ComObjType can be used to determine the type of the retrieved object.
ja: ComObjTypeは、取得したオブジェクトのタイプを決定するために使います。

source: ComObject (formerly ComObjCreate) and ComObjQuery now return a wrapper object even if an IID is specified.
ja: ComObject（旧ComObjCreate）とComObjQueryは、IIDが指定されていても、ラッパーオブジェクトを返すようになりました。

source: ComObject, ComObjQuery, ComValue, Buffer object, CallbackCreate
ja: ComObject、ComObjQuery、ComValue、Bufferオブジェクト、CallbackCreate

source: ComObject, which is a class now
ja: ComObject クラスになりました。

source: ComValue or ComObject
ja: ComValueまたはComObject

source: ComValue, which is a class now
ja: ComValue クラスになりました。

source: Compress the exe with MPRESS?
ja: MPRESSでexeを圧縮しますか？

source: Concatenation
ja: 連結

source: Concepts and Conventions:
ja: 概念と慣習：

source: Concepts and Conventions: General explanation of various concepts utilised by AutoHotkey.
ja: 概念と慣習：AutoHotkeyで利用される様々な概念についての一般的な説明。

source: Concepts and conventions:
ja: 概念と慣習

source: Concepts and conventions: explanations of various things you need to know.
ja: 概念と慣習：さまざまな角度からの解説。

source: ConsoleApp: Sets Console mode.
ja: ConsoleApp：コンソールモードを設定する。

source: Cont: Specifies a directive continuation line.
ja: Cont：指示継続行を指定する。

source: ContextMenu event
ja: ContextMenuイベント

source: Continuation by enclosure:
ja: 囲い込みによる継続：

source: Continuation by enclosure: A sub-expression enclosed in (), [] or {} can automatically span multiple lines in most cases.
ja: 囲い込みによる継続：()、[]、{}で囲まれた部分式は、ほとんどの場合、自動的に複数行にまたがることができます。

source: Continuation operator:
ja: 継続オペレーター：

source: Continuation operator: Start or end a line with an expression operator to join it to the previous or next line.
ja: 継続オペレーター：式演算子で行を開始または終了し、前の行または次の行に連結する。

source: Continuation prefix:
ja: 継続の接頭辞

source: Continuation prefix: Lines that begin with an expression operator (except ++ and --) are merged with the previous line.
ja: 継続の接頭辞：式演算子で始まる行（++と--を除く）は、前の行と統合されます。

source: Continuation section:
ja: 継続の部：

source: Continuation section: Mark a group of lines to be merged together, with additional options such as what text (or code) to insert between lines.
ja: 継続の部：マージする行のグループをマークし、行間に挿入するテキスト（またはコード）などのオプションを追加する。

source: Continuation section: Multiple lines are merged with the line above the section, which starts with ( and ends with ) (both symbols must appear at the beginning of a line, excluding whitespace).
ja: 継続の部：複数の行は、セクションの上にある、(で始まり、)で終わる行にマージされます（両方の記号は、空白を除いて行頭に現れる必要があります）。

source: Continue skips the rest of the current loop iteration and begins a new one.
ja: Continueは、現在のループ反復の残りをスキップして、新しいループを開始します。

source: Continue, Loop, While-loop, For-loop, Blocks, Labels
ja: Continue、Loop、Whileループ、Forループ、ブロック、ラベル
